jmeter/get_id_10req.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5-SNAPSHOT e7292cc">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">10</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsIng1dCI6Imwzc1EtNTBjQ0g0eEJWWkxIVEd3blNSNzY4MCIsImtpZCI6Imwzc1EtNTBjQ0g0eEJWWkxIVEd3blNSNzY4MCJ9.eyJhdWQiOiJhcGk6Ly9hZDU5ZDU2Yy03MDUzLTRjNzctOWEwYi0wYzRhYTMwZGRiMzgiLCJpc3MiOiJodHRwczovL3N0cy53aW5kb3dzLm5ldC83ODgyMDg1Mi01NWZhLTQ1MGItOTA4ZC00NWMwZDkxMWU3NmIvIiwiaWF0IjoxNjM1NjYxNDMzLCJuYmYiOjE2MzU2NjE0MzMsImV4cCI6MTYzNTY2NTMzMywiYWlvIjoiRTJaZ1lEaDk2TzI3TXp1ZVpHUk15Y3FiY3JuREZRQT0iLCJhcHBpZCI6IjQwMWFmYjc2LTBkOWMtNDVjNi04OWIwLWNmZjg1NDE0YWQ2OCIsImFwcGlkYWNyIjoiMSIsImlkcCI6Imh0dHBzOi8vc3RzLndpbmRvd3MubmV0Lzc4ODIwODUyLTU1ZmEtNDUwYi05MDhkLTQ1YzBkOTExZTc2Yi8iLCJvaWQiOiJiNjc2NTdkOC1iNTEwLTQzYjItYjIwYS1iNjY0Zjk4NmY5MzUiLCJyaCI6IjAuQVRVQVVnaUNlUHBWQzBXUWpVWEEyUkhuYTNiN0drQ2NEY1pGaWJEUC1GUVVyV2cxQUFBLiIsInJvbGVzIjpbIlVzZXJzLlVwbnMuV3JpdGUiLCJVc2Vycy5JZGVudGl0eU51bWJlci5SZWFkIiwiVXNlcnMuVXBucy5SZWFkIiwiVXNlcnMuT2lkcy5Xcml0ZSJdLCJzdWIiOiJiNjc2NTdkOC1iNTEwLTQzYjItYjIwYS1iNjY0Zjk4NmY5MzUiLCJ0aWQiOiI3ODgyMDg1Mi01NWZhLTQ1MGItOTA4ZC00NWMwZDkxMWU3NmIiLCJ1dGkiOiJyNDZqbjE4TEIwR3k3MmJUZDVJakFRIiwidmVyIjoiMS4wIn0.ATeghH9gZV00c_Ps1f-IQmaS8Jlr_zTfzQ0MgS_YVgXeO0KgWBFycy6leNLSJhvdt_ARnvvM-i4AtV2PW6oNN_wd_m1EUicrw3QWWo4ARCGQWNAGuliNeC-Mo2T1QyTcXuYg0xbvxOyde8F5lXtB0HpcnpcXsSuzSg25f38DuRUtoE8FnKw8048lFB4QZn6BT40WFJJaOXhZ0HnECdqnB-tLtJKcz9e0OUs90W0v_fBqq1dd1Kj-pRiLGEdt1JpLwz_zY6YFHvhGlUKTe5abr7lt1axWMO8QmcjJieSxwMD2TjXDkrneIdppdT1CR2uK7hiGLJfDMLo5_HxZoAfqQw</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;identityNumber&quot;: &quot;222222222&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">https://mhub.idf.il/idfapi/api/users/getUpn</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>